<template>
  <div id="register">
    <p class="page-title">회원가입</p>
    <div class="agreement-box">
      <div class="top">
        <label>
          <input type="checkbox">
          전체 동의
        </label>
      </div>
      <div class="bottom">
        <div class="line">
          <label>
            <input type="checkbox">
            <span class="red">[필수]</span>
            약관 동의
          </label>
          <span class="more">자세히</span>
          <div class="detail" @click="">
            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.
          </div>
        </div>
        <div class="line">
          <label>
            <input type="checkbox">
            <span class="red">[필수]</span>
            개인정보 처리방침
          </label>
          <span class="more">자세히</span>
          <div class="detail" @click="">
            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.
          </div>
        </div>
        <div class="line">
          <label>
            <input type="checkbox">
            <span class="red">[필수]</span>
            개인정보 위탁 관리 방침
          </label>
          <span class="more">자세히</span>
          <div class="detail" @click="">
            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.            약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.             약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.약관내용입니다. 약관내용입니다. 약관내용입니다.
          </div>
        </div>
      </div>
    </div>
    <div class="register-box">
      <div class="line">
        <span class="label">이메일<span class="req"> *</span></span>
        <input type="email"/>
        <span class="cert-btn">인증번호 전송</span>
      </div>
      <div class="line">
        <span class="label">인증번호 입력<span class="req"> *</span></span>
        <input type="text"/>
        <span class="cert-btn">인증번호 전송</span>
      </div>
      <div class="line">
        <span class="label">비밀번호<span class="req"> *</span></span>
        <input type="text"/>
      </div>
      <p class="tip">*영문/숫자/특수문자 8~20자리</p>
      <div class="line">
        <span class="label">비밀번호 확인<span class="req"> *</span></span>
        <input type="text"/>
      </div>
      <hr>
      <div class="line">
        <span class="label">담당자<span class="req"> *</span></span>
        <input type="text"/>
      </div>
      <div class="line">
        <span class="label">연락처<span class="req"> *</span></span>
        <input type="text" placeholder="010 1234 1234"/>
      </div>
      <div class="line">
        <span class="label">회사명<span class="req"> *</span></span>
        <input type="text" placeholder=""/>
      </div>
      <div class="line">
        <span class="label">직무/직책<span class="sel"> (선택)</span></span>
        <div class="select-container">
          <div class="select-box">
            dd
            <span class="icn"></span>
          </div>
          <div class="select-list">
            <p>1 ~ 10인</p>
            <p>11 ~ 50인</p>
            <p>51 ~ 100인</p>
            <p>101인 이상</p>
          </div>
        </div>
      </div>
      <div class="line">
        <span class="label">유입 경로<span class="sel"> (선택)</span></span>
        <div class="select-container">
          <div class="select-box">
            dd
            <span class="icn"></span>
          </div>
          <div class="select-list">
            <p>지인 소개</p>
            <p>블로그</p>
            <p>인스타그램</p>
            <p>포털 사이트 (네이버, 구글 등)</p>
            <p>기타</p>
          </div>
        </div>
      </div>
    </div>
    <a class="submit">완료</a>
  </div>
</template>


<script>

export default {
  props: [''],
  data() {
    return {

    }
  },
  watch: {

  },
  methods: {

  },
  created() {
  }
}
</script>
